<div style="font-size: 36px;">
COMS W4111 -- Introduction to Databases, Spring 2026<br>Lecture 4 Examples
</div>

# Initialize Environment

In [ ]:
%load_ext sql

In [ ]:
# %magic

In [ ]:
# %pip install pandas
# %pip install pymysql

In [ ]:
db_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [ ]:
# This is a hack to fix a version problem/incompatibility  with some of the packages and magics.
#
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
%sql $db_url

In [ ]:
import pandas

In [ ]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine(db_url)

# Complex Attribute Examples

## Derived Attributes (Columns) Example in SQL

In [ ]:
%%sql

create schema if not exists S2026_Examples;

use S2026_Examples;

drop table if exists S2026_examples.columbia_section;

create table if not exists S2026_examples.columbia_section
(
    callno       varchar(12)          not null
        primary key,
    course_no    varchar(12)          not null,
    section_no   varchar(3)           not null,
    semester     enum ('1', '2', '3') not null,
    section_year year                 not null,
    section_id   varchar(32) as (concat(`course_no`, _utf8mb4'_', `section_no`, _utf8mb4'_', `semester`, _utf8mb4'_',
                                        `section_year`)) stored,
    constraint columbia_section_id_pk
        unique (course_no, section_no, semester, section_year)
);

Some observations:
- A generated column may be ```virtual``` and computed when selected or may be ```stored``` and set on insert/update.<br><br>
- I choose ```stored``` because it would allow me to reference from a foreign key if I wanted.<br><br>
- Unlike the book examples, I used an ```enum``` instead of a ```check constraint``` for handling the semester.<br><br>
- The ```_utf8mb4``` is optional and is the character set and character to use. I could have just used ```_```.

In [ ]:
%%sql

use S2026_Examples;

insert into columbia_section(callno, course_no, section_no, semester, section_year)
    values(1234, 'COMSW4143', '001', '3', 2025);

In [ ]:
%sql select * from columbia_section;

In [ ]:
%%sql

drop table if exists S2026_examples.person_base;

create table if not exists S2026_examples.person_base
(
    person_ID       int             primary key     auto_increment,
    last_name       varchar(128)    not null,
    first_name      varchar(128)    not null,
    date_of_birth   date            not null
);

create or replace view S2026_examples.person_age as
    select
        *,
        TIMESTAMPDIFF(YEAR, date_of_birth, CURDATE()) AS age
    from
        person_base;

Some observations:
- I used the [TIMESTAMPDIFF](https://www.w3resource.com/mysql/date-and-time-functions/mysql-timestampdiff-function.php) bulit in function. I chose to compute the difference in YEARs. Other options are ```DAY, WEEK, MONTH, HOUR, ... ...```.<br><br>
- I had to use a ```VIEW``` because MySQL does not allow some functions, e.g. ```CURDATE```, in automatically generated columns.

## Multi-valued Attribute

The [IMDB dataset](https://developer.imdb.com/non-commercial-datasets/) has some interesting examples of the challenges representing semi-structured data in the relational model. One of the CSV files is ```title_basics.```

title.basics.tsv.gz
- tconst (string) - alphanumeric unique identifier of the title
- titleType (string) – the type/format of the title (e.g. movie, short, tvseries, tvepisode, video, etc)
- primaryTitle (string) – the more popular title / the title used by the filmmakers on promotional materials at the point of release
- originalTitle (string) - original title, in the original language
- isAdult (boolean) - 0: non-adult title; 1: adult title
- startYear (YYYY) – represents the release year of a title. In the case of TV Series, it is the series start year
- endYear (YYYY) – TV Series end year. '\N' for all other title types
- runtimeMinutes – primary runtime of the title, in minutes
- genres (string array) – includes up to three genres associated with the title

In [ ]:
title_basics_df = pandas.read_csv("got_imdb_title_basics.csv")

In [ ]:
title_basics_df.head(10)

There would be a bunch of data engineering cleanup necessary to get the data into a good relational database schema, e.g.
- String lengths
- ```title_type``` is an ```enum```
- ```start_year``` and ```end_year``` are ```YEAR``` not floats.
- ```run_time_minutes``` is an ```int``` and ```> 0.```
- ```genres``` is a multi-valued attribute.
- ... ...

## A Diversion $-$ Loading Data Examples

### Loading and Saving

There are several ways to load data files into an SQL database.

MySQL and other databases provide a ```LOAD DATA``` command (https://www.tutorialspoint.com/mysql/mysql_load_data.htm). For security reasons, this requires some "complex" database settings that I do not want you to have to use.

Many development tools for relational databases, including DataGrip, have data loading/import wizards.

For very large datasets, there are products that specialize in efficient loading.

In most cases in this class for simplicity we will use
- [Pandas](https://pandas.pydata.org/) "pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.."
- [SQLAlchemy](https://www.sqlalchemy.org/) "SQLAlchemy is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL."

In [ ]:
%sql drop schema if exists lecture_4_examples
%sql create schema lecture_4_examples

In [ ]:
title_basics_df = pandas.read_csv("got_imdb_title_basics.csv")

In [ ]:
title_basics_df.head(10)

In [ ]:
title_basics_df.to_sql(
    "title_basics", schema="lecture_4_examples", con=engine, index=False, if_exists="replace"
)

In [ ]:
%sql select * from lecture_4_examples.title_basics limit 10

### Cleaning

In [ ]:
%sql describe lecture_4_examples.title_basics

There are several issues with this default schema. Some examples:
- ```text``` is a CLOB and unecessarily large.
- Several columns that are ```NOT NULL``` default to ```NULL```.
- ```isAdult``` is a ```BOOLEAN``` not a "big integer."
- ```startYear```and ```endYear``` are "years," not ```DOUBLE```.
- ```genres``` is multi-valued.
- ```titleType``` is an ```ENUM```.

How do I know that ```titleType``` is an ```ENUM```? I explore the data.

In [ ]:
%sql select distinct title_type from lecture_4_examples.title_basics;

You can see that ```genres``` is multi-valued, and the individual values domain seems to be a fixed set of values, i.e. an ```ENUM.```

You can also infer that a ```title_basics``` has many ```genres``` and a ```genre``` may apply to several ```title_basics.``` $\Rightarrow$ We need an associative entity.

A better model is 

| <img src="multi-valued-erd.jpg"> |
| :---: |
| __Multi-Valued Attributes__ |

It would be relatively easy to write some python code that querie the table, splits the genre into a separate dataframe, creates a dataframe with the associations and write all of the entities to the database.

This approach works for relatively small datasets.

If the dataset is very large, this can be inefficient/expensive. The notebook and database are different programs running in different processes, perhaps on different machines $\Rightarrow$ That is a lot of data movement.

We will see that we can write SQL queries to accomplish the transformation in the databases, which will be much more efficient.
But this requires some additional concepts.

#### How Many Genres?

Using some string functions and a little bit of math, we can figure out how many ```genre``` values are in the lists.

In [ ]:
%%sql

use lecture_4_examples;

with one as (select `genres`,
                    length(title_basics.`genres`)                   as original_length,
                    length(replace(title_basics.`genres`, ',', '')) as no_commas
             from title_basics)
select genres,
       original_length,
       no_commas,
       original_length-no_commas+1 as no_of_genres
       from one
order by no_of_genres desc
limit 10;

#### Load the Genres Table

In [ ]:
%%sql

drop table if exists tconst_genres;

create table tconst_genres as 
with one as (
    select
        tconst,
        genres,
        substr(genres, 1, position("," in title_basics.genres)-1)as g1,
        substr(genres, position("," in title_basics.genres)+1) as remainder
    from
        title_basics
),
    two as (
        select
            tconst,
            genres,
            g1,
            substr(remainder, 1, position("," in one.remainder)-1) as g2,
            substr(remainder, position("," in remainder)+1) as g3
    from
        one
    ),
three as (
    select
        tconst,
        if (g1='', NULL, g1) as g1,
        if (g2='', NULL, g2) as g2,
        if (g3='', NULL, g3) as g3
    from two
)
select tconst, g1 as genre from three where g1 is not null
union
select tconst, g2 as genre from three where g2 is not null
union
select tconst, g3 as genre from three where g3 is not null
order by tconst;

In [ ]:
%%sql

select
    tconst, genres, genre
from
    title_basics join tconst_genres using(tconst)
order by tconst;

These are some simple examples of data engineering, which we will do as part of implementing our project in the coming homework assignments.

# SQL Examples

## Unique Key Constraint

In [ ]:
%sql use s2025_examples;

In [ ]:
%%sql
drop table if exists unique_example;

create table unique_example
(
    part1 int null,
    part2 int null,
    part3 int null,
    constraint unique_example_pk
        unique (part1, part2, part3)
);

Let's do some testing, and also show how to access a database from an application. 

Some helper code.

In [ ]:
%sql insert into unique_example values(1, 2, 3);

In [ ]:
%sql insert into unique_example values(1, 2, 3);

What if some of the columns are NULL?

In [ ]:
%sql insert into unique_example values(1, 2, NULL);

In [ ]:
%sql insert into unique_example values(1, 2, NULL);

In [ ]:
%sql select * from unique_example

At first examination, that does not seem right. It looks like we have violated uniqueness. But remember ```NULL``` does not equal ```NULL.```

In [ ]:
%%sql

select
    if ((1=1 and 2=2 and NULL=NULL), "Key is the same", "Key is NOT the same") as is_a_duplicate_key

Some observations:
- ```NULL``` can be counter-intuitive but its behavior makes sense when we see more complex examples.
- You can put ```IF()``` and ```IFNULL()``` in the "project clause" to produce a conditional values.

## Check Constraint and ENUMs

In [ ]:
%%sql

use s2025_examples;

drop table if exists section_enum;
drop table if exists section_check;

create table section_check 
                   (course_id varchar (8),
                    sec_id varchar (8),
                    semester varchar (6),
                    year numeric (4,0),
                    building varchar (15),
                    room_number varchar (7),
                    time_slot_id varchar (4), 
                    primary key (course_id, sec_id, semester, year),
                    check (semester in ('Fall', 'Winter', 'Spring', 'Summer')),
                   check ((room_number >= 0) AND (room_number <= 500)));


create table section_enum
(
    course_id    varchar(8),
    sec_id       varchar(8),
    semester     ENUM ('Fall', 'Winter', 'Spring', 'Summer'),
    year         numeric(4, 0),
    building     varchar(15),
    room_number  varchar(7),
    time_slot_id varchar(4),
    primary key (course_id, sec_id, semester, year)
);

- How do these manifest?

In [ ]:
%%sql

insert into section_check
    values ("W4111", "002", "Banana", 2025, "MATH", 207, "F1");

In [ ]:
%%sql

insert into section_enum
    values ("W4111", "002", "Banana", 2025, "MATH", 207, "F1");

In [ ]:
%%sql

insert into section_check
    values ("W4113", "002", "Summer", 2025, "MATH", "501", "F1");

- The error for the ENUM gives a strange message

## Data Time Example -- Date, Time

The [Classic Models Database](https://www.mysqltutorial.org/getting-started-with-mysql/mysql-sample-database/), which we will start to use for more complex SQL, provides some examples.

| <img src="mysql-sample-database.png" width="700px;"> |
| :---: |
| __Classic Models Databases__ |

In [ ]:
%sql use classicmodels;

In [ ]:
%sql show tables

This is an example of a metadata query that uses the "catalog." We will discuss metadata queries in the future.

Let's take a look at ```Orders```.

In [ ]:
%sql select * from orders limit 10;

Why isn't ```orderDate``` just a ```CHAR(10)```?

In [ ]:
%%sql

insert into orders(orderNumber, orderDate, status, customerNumber)
    values(10100, "Banana", "Shipped", 363)

We can also do some more advanced things with certain functions.

In [ ]:
%%sql

select
    orderNumber,
    orderDate, shippedDate,
    datediff(shippedDate, orderDate) as time_to_ship_in_days
from orders limit 5;

In [ ]:
%%sql

select
    orderNumber,
    orderDate,
    dayname(orderDate) as ordered_day_of_week,
    quarter(orderDate) as ordered_quarter
from orders
where quarter(orderDate)=2 and dayname(orderDate)="Friday"
limit 10;

There are similar concepts for datetime, timestamp, ... and other domains.

This is an example of more complex data types that you can use and a rich library of operations that understand the data types.

## Common Table Expressions

Produce information on all of customer 363's orders that includes the information from ```customers, orders, orderdetails``` and ```products.```

In [ ]:
%%sql

use classicmodels;

with one as (
   select customerNumber, customerName, orderNumber, status from customers join orders using(customerNumber)
),
    two as (
        select one.*, productCode, quantityOrdered from one join orderdetails using(orderNumber)
    ),
    three as (
        select two.*, productLine, productDescription from two join products using(productCode)
    )
select * from three where customerNumber=363
limit 5;

You can break the task down into a set of simpler tasks.

Use common table expressions to add one task/query at a time.

I write my queries this way. When I give you complex examples, you will find using WITH makes things a lot easier.

WITH also makes it easier for the TAs and me to understand your query.

Understandability is an important consideration when writing a query.

"“Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live” John Woods.

## Some Subquery Examples

In [ ]:
%sql use db_book;

In [ ]:
# Let's look at classrooms.
#
%sql select * from classroom;

In [ ]:
%sql select * from section;

In [ ]:
%%sql

/*
    Let's find the sections that are in a classroom with at least 70 seat capacity.
*/
select
    *,
    (select capacity from classroom where
        classroom.building=section.building and classroom.room_number=section.room_number) as room_capacity
from
    section
where
    (select capacity from classroom where
        classroom.building=section.building and classroom.room_number=section.room_number) >= 70;

A simple approach to student and advisor.

In [ ]:
%%sql

select
    s_id as student_id,
    (select name from student where ID=s_id) as student_name,
    i_id as advisor_id,
    (select name from instructor where ID=i_id) as advisor_name
from  
    advisor;

## Aggregate Functions Example

Compute a table for the form

```
(customerNumber, customerName, no_of_orders, total_revenue)
```

for customers in ```France``` with ```total_revenue``` greater than ```$100,000```.

In [ ]:
%%sql
use classicmodels;

with one as (select *
             from orders
                      join orderdetails using (orderNumber)),
     two as (select customerNumber,
                    count(*)                            no_of_orders,
                    sum(priceEach * quantityOrdered) as total_revenue
             from one
             group by customerNumber having total_revenue >= 100000)
select customerNumber,
       (select customerName
        from customers
        where customers.customerNumber = two.customerNumber) as customerName,
       no_of_orders,
       concat("$", format(total_revenue, 2)) as total_revenue
from two
where (select country from customers where customers.customerNumber = two.customerNumber) = 'France'

This example pulls together several concepts we have learned:
1. ```WITH``` and common table expressions.
2. Subquery in the ```SELECT``` and ```WHERE1``` clause.
3. Aggregate functions.
4. Data type specific functions, e.g. ```concat``` and ```format```.

## Outer JOIN

The previous example was not completely currenct.

It does not capture ```customers``` that have no placed any ```order```.

In [ ]:
%%sql

select * from customers join orders using(customerNumber)

This returns ```326``` entries.

In [ ]:
%%sql

select * from customers left join orders using(customerNumber)

You can see that there some customers that were not JOINed with an order.

Which customers are these?

In [ ]:
%%sql

select * from customers left join orders using(customerNumber) where orderNumber is NULL;

Let's modify the preceeding query to:
1. Not constrain the result to customers in France.
2. Not worry about the $100,000 limit.

In [ ]:
%%sql

with one as (select *
             from orders
                      join orderdetails using (orderNumber)),
     two as (select customerNumber,
                    count(*)                            no_of_orders,
                    sum(priceEach * quantityOrdered) as total_revenue
             from one
             group by customerNumber)
select customerNumber,
       customerName,
       ifnull(no_of_orders, 0),
       ifnull(total_revenue, concat("$", 0))
from
customers left join two using(customerNumber);

## Metadata

In [ ]:
%sql show databases;

In [ ]:
%sql show tables from classicmodels;

In [ ]:
%sql describe classicmodels.customers;

A lot of these commands are "helper commands" that are not necessarily standard. They make some queries on ```information_schema``` easier.

In [ ]:
%sql use information_schema

In [ ]:
%%sql

select
    *
from
    TABLES
where
    TABLE_SCHEMA="classicmodels";

In [ ]:
%%sql

select
    *
from
    COLUMNS
where
    TABLE_SCHEMA="classicmodels" and TABLE_NAME="customers";

In [ ]:
%%sql

select
    *
from
    KEY_COLUMN_USAGE
where
    TABLE_SCHEMA="classicmodels"
order by table_name, column_name, ordinal_position;